### Report for environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "3.44.0"...
- Installing hashicorp/aws v3.44.0...
- Installed hashicorp/aws v3.44.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (2 to add, 7 to change, 2 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.inbound_nlb_down_errors will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "inbound_nlb_down_errors" {
      ~ dimensions                            = {
          ~ "LoadBalancer" = "app/dev-repo-mhs-out-alb/95f01e1ef1c15d88" -> "net/dev-repo-mhs-inbound/c5668e5303a26407"
          ~ "TargetGroup"  = "targetgroup/dev-repo-mhs-outbound/2965b97cc88ed832" -> "targetgroup/dev-repo-mhs-in-https/3e333c669edf7b00"
        }
        id                                    = "prm-mhs-infra service down"
      ~ namespace                             = "AWS/ApplicationELB" -> "AWS/NetworkELB"
        tags                                  = {}
        # (20 unchanged attributes hidden)
    }

  # aws_ecs_cluster.mhs_inbound_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "mhs_inbound_cluster" {
        id                 = "arn:aws:ecs:eu-west-2:416874859154:cluster/dev-repo-mhs-inbound-cluster"
        name               = "dev-repo-mhs-inbound-cluster"
        tags               = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-repo-mhs-cluster"
        }
        # (3 unchanged attributes hidden)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster.mhs_outbound_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "mhs_outbound_cluster" {
        id                 = "arn:aws:ecs:eu-west-2:416874859154:cluster/dev-repo-mhs-outbound-cluster"
        name               = "dev-repo-mhs-outbound-cluster"
        tags               = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-repo-mhs-outbound"
        }
        # (3 unchanged attributes hidden)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.mhs_inbound_service will be updated in-place
  ~ resource "aws_ecs_service" "mhs_inbound_service" {
        id                                 = "arn:aws:ecs:eu-west-2:416874859154:service/dev-repo-mhs-inbound-cluster/dev-repo-mhs-inbound"
        name                               = "dev-repo-mhs-inbound"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:416874859154:task-definition/dev-repo-mhs-inbound:105" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.mhs_outbound_service will be updated in-place
  ~ resource "aws_ecs_service" "mhs_outbound_service" {
        id                                 = "arn:aws:ecs:eu-west-2:416874859154:service/dev-repo-mhs-outbound-cluster/dev-repo-mhs-outbound"
        name                               = "dev-repo-mhs-outbound"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:416874859154:task-definition/dev-repo-mhs-outbound:111" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.mhs_inbound_task must be replaced
-/+ resource "aws_ecs_task_definition" "mhs_inbound_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:416874859154:task-definition/dev-repo-mhs-inbound:105" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "dev-repo-mhs-inbound" -> (known after apply)
      ~ revision                 = 105 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-mhs-inbound-task"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.mhs_outbound_task must be replaced
-/+ resource "aws_ecs_task_definition" "mhs_outbound_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:416874859154:task-definition/dev-repo-mhs-outbound:111" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "dev-repo-mhs-outbound" -> (known after apply)
      ~ revision                 = 111 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-mhs-outbound-task"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_security_group.mhs_inbound_security_group will be updated in-place
  ~ resource "aws_security_group" "mhs_inbound_security_group" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound HTTPS traffic to the public Internet to pull Docker image from Docker Hub"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
            # (4 unchanged elements hidden)
        ]
        id                     = "sg-0bc32c01c6c937a13"
        name                   = "dev-mhs-inbound-sg"
        tags                   = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-mhs-inbound-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.outbound_ecs_tasks_sg will be updated in-place
  ~ resource "aws_security_group" "outbound_ecs_tasks_sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound HTTPS traffic to the public Internet to pull Docker image from Docker Hub"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
            # (4 unchanged elements hidden)
        ]
        id                     = "sg-0427ee6188a1115a3"
        name                   = "dev-repo-mhs-out-ecs-tasks-sg"
        tags                   = {
            "CreatedBy"   = "prm-mhs-infra"
            "Environment" = "dev"
            "Name"        = "dev-repo-mhs-out-ecs-tasks-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 7 to change, 2 to destroy.

```

</details>